require 'os'

tap 'homebrew/bundle'

brew 'awscli'
brew 'bash-completion'
brew 'bat'
brew 'cmake'
brew 'colordiff'
brew 'ctop'
brew 'curl', args: ['with-nghttp2']
brew 'diff-so-fancy'
brew 'fd'
brew 'ffmpeg'
brew 'git'
brew 'glances'
brew 'go'
brew 'graphviz'
brew 'htop'
brew 'httpie'
brew 'httpstat'
brew 'jq'
brew 'kubectx'
brew 'kubernetes-helm'
brew 'mediainfo'
brew 'mplayer'
brew 'openssl'
brew 'prettyping'
brew 'python'
brew 'ripgrep'
brew 'rsync'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'wrk'

if OS.mac?
  puts "MAC"
  cask_args appdir: '/Applications'

  brew 'ngrep'
  brew 'reattach-to-user-namespace'

  cask '1password'
  cask 'android-studio'
  cask 'atom'
  cask 'authy'
  cask 'caffeine'
  cask 'calibre'
  cask 'daisydisk'
  cask 'displaylink'
  cask 'docker-edge'
  cask 'dropbox'
  cask 'evernote'
  cask 'firefox'
  cask 'gimp'
  cask 'gitx'
  cask 'google-chrome'
  cask 'google-drive'
  cask 'itau'
  cask 'iterm2'
  cask 'karabiner-elements'
  cask 'libreoffice'
  cask 'postman'
  cask 'skype'
  cask 'slack'
  cask 'vagrant'
  cask 'virtualbox'
  cask 'vlc'
  cask 'wireshark'
  cask 'zoomus'
end
