cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'bash-completion'
brew 'git'
brew 'go'
brew 'nginx'
brew 'nvm'
brew 'openssl'
brew 'tsuru'
brew 'tsuru-admin'
brew 'watchman'

cask '1password'
cask 'atom'
cask 'caffeine'
cask 'calibre'
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'gitx'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'slack'
cask 'vlc'
