cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'bash-completion'
brew 'cmake'
brew 'colordiff'
brew 'ffmpeg'
brew 'git'
brew 'go'
brew 'htop'
brew 'httpie'
brew 'httpstat'
brew 'macvim'
brew 'mediainfo'
brew 'mplayer'
brew 'nginx'
brew 'ngrep'
brew 'nvm'
brew 'openssl'
brew 'python'
brew 'ripgrep'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'tsuru'
brew 'tsuru-admin'
brew 'watchman'
brew 'wget'
brew 'wrk'
brew 'yarn'

cask '1password'
cask 'android-studio'
cask 'atom'
cask 'caffeine'
cask 'calibre'
cask 'daisydisk'
cask 'displaylink'
cask 'docker'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'gimp'
cask 'gitx'
cask 'google-chrome'
cask 'google-drive'
cask 'iterm2'
cask 'java'
cask 'libreoffice'
cask 'skype'
cask 'slack'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'wireshark'
